app/controllers/projects_controller.rb

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def index
    @projects = Project.find(:all)

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
---
  def clone
    parent    = Project.find(params[:id])

INSERT INTO "projects" ("name", "updated_at", "description", "links", "members", "parent", "created_at") VALUES('TAGghino', '2008-11-16 16:28:55', 'Lorem ipsum *dolor* sit amet, ligula suspendisse nulla pretium, rhoncus tempor placerat fermentum, enim integer ad vestibulum volutpat. Nisl rhoncus turpis est, vel elit, congue wisi enim nunc ultricies sit, magna tincidunt. Maecenas aliquam maecenas ligula nostra, accumsan taciti. Sociis mauris in integer, a dolor netus non dui aliquet, sagittis felis sodales, dolor sociis mauris, vel eu libero cras. Interdum at. Eget habitasse elementum est, ipsum purus pede porttitor class, ut adipiscing, aliquet sed auctor, imperdiet arcu per diam dapibus libero duis. Enim eros in vel, volutpat nec pellentesque leo, scelerisque nec.', '* "google":http://google.com
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = 1)
UPDATE "projects" SET "description" = 'Lorem ipsum *dolor* sit amet, ligula suspendisse nulla pretium, rhoncus tempor placerat fermentum, enim integer ad vestibulum volutpat. Nisl rhoncus turpis est, vel elit, congue wisi enim nunc ultricies sit, magna tincidunt. Maecenas aliquam maecenas ligula nostra, accumsan taciti. Sociis mauris in integer, a dolor netus non dui aliquet, sagittis felis sodales, dolor sociis mauris, vel eu libero cras. Interdum at. Eget habitasse elementum est, ipsum purus pede porttitor class, ut adipiscing, aliquet sed auctor, imperdiet arcu per diam dapibus libero duis. Enim eros in vel, volutpat nec pellentesque leo, scelerisque nec.', "updated_at" = '2008-11-16 15:24:50' WHERE "id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])